<a href="https://colab.research.google.com/github/CharlesPrado23/Bootcamp2oSemestre2021/blob/main/Semana5/Semana5(SQL)_Aula.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import sqlite3
engine = sqlite3.connect('sql.db')

In [2]:
cursor = engine.cursor()

cursor.execute("PRAGMA foreign_keys = ON").fetchall()

### cursor.execute("PRAGMA foreign_keys").fetchall()

[]

### Syntax:
### "CREATE [TEMP | TEMPORARY] TABLE table-name (
### column-def[, column-def]
### [,constraint]);

### column-def:
### name [type] [[CONSTRAINT name] column-constraint]"

In [ ]:
sql_create_projects_table = 'CREATE TABLE IF NOT EXISTS projects (\
                                        id integer PRIMARY KEY,\
                                        name text NOT NULL,\
                                        begin_date text,\
                                        end_date text\
                                    )'

In [ ]:
sql_create_tasks_table = """CREATE TABLE IF NOT EXISTS tasks (
                                    id integer PRIMARY KEY,
                                    name text NOT NULL,
                                    priority integer,
                                    status_id integer NOT NULL,
                                    project_id integer NOT NULL REFERENCES projects (id),
                                    begin_date text NOT NULL,
                                    end_date text NOT NULL
                                );"""
# StudentId INT REFERENCES Student (StudentId)
#FOREIGN KEY (project_id) REFERENCES projects (id)

In [ ]:
### Command execute #####
cursor.execute(sql_create_projects_table)

In [ ]:
#### Commit #####
engine.commit()

In [ ]:
cursor.execute('PRAGMA table_info(projects)').fetchall()

[(0, 'id', 'integer', 0, None, 1),
 (1, 'name', 'text', 1, None, 0),
 (2, 'begin_date', 'text', 0, None, 0),
 (3, 'end_date', 'text', 0, None, 0)]

In [ ]:
data = cursor.execute('PRAGMA table_info(projects)').fetchall()
type(data[0])
for d in data:
  print(d[0],d[1],d[2])

0 id integer
1 name text
2 begin_date text
3 end_date text

In [ ]:
cursor.execute(sql_create_tasks_table)

In [ ]:
#### Types de cada atributo da Tabela ####### 
#### Comando PRAGMA table_info("Nome da tabela") 
sql_info = 'PRAGMA table_info(tasks)'
data = cursor.execute(sql_info).fetchall()
for d in data:
  print(d[0],d[1],d[2])

0 id integer
1 name text
2 priority integer
3 status_id integer
4 project_id integer
5 begin_date text
6 end_date text

## SYNTAX (INSERT): 

### "INSERT [OR conflict-algorithm]
### INTO [database-name .] table-name [(column-list)]
### VALUES (value-list)"

In [ ]:
### Comando Insert ##### 
### INSERT INTO table VALUES () 
### INSERT INTO table (columns) VALUES ()

In [ ]:
sql_insert = 'INSERT INTO projects VALUES(20,"PROJETO_01","2021-07-18"," ")'
cursor.execute(sql_insert)

In [ ]:
engine.commit()

In [ ]:
sql_insert2 = 'INSERT INTO projects (name,begin_date,end_date) VALUES("PROJETO_02"," ", " ")'
cursor.execute(sql_insert2)
engine.commit()

In [ ]:
sql_insert3 = 'INSERT INTO projects (name) VALUES("PROJETO_03")'
cursor.execute(sql_insert3)
engine.commit()

In [ ]:
 #### Comando SELECT #####
 ###. SELECT * FROM table #####
data = cursor.execute('SELECT * FROM projects ').fetchall()
for row in data: 
  print(row)

(20, 'PROJETO_01', '2021-07-18', ' ')
(21, 'PROJETO_02', ' ', ' ')
(22, 'PROJETO_03', None, None)

In [ ]:
### INSERT values into Task ###### 
sql_insert3 = 'INSERT INTO tasks VALUES(200,"tarefa_01",0,20,22,"","")'
cursor.execute(sql_insert3)
engine.commit()

In [ ]:
### LER os valores inseridos #######
cursor.execute('SELECT * FROM tasks').fetchall()

[(100, 'tarefa_01', 0, 20, 22, '', ''), (200, 'tarefa_01', 0, 20, 22, '', '')]

## SYNTAX (SELECT): 

### SELECT [ALL | DISTINCT] result [FROM table-list]
### [WHERE expr]
### [GROUP BY expr-list]
### [HAVING expr]
### [compound-op select]*
### [ORDER BY sort-expr-list]
### [LIMIT integer [(OFFSET|,) integer]]

In [3]:
### CREATE TABLE EMP and DEPTO #######
cursor.execute('''CREATE TABLE IF NOT EXISTS EMP (EMPNO int, ENAME text, JOB text, MGR int, HIREDATE date, SAL real,COMM int, DEPTNO int)''')

In [ ]:
data = cursor.execute("PRAGMA table_info(EMP)").fetchall()
for d in data:
    print (d[0], d[1], d[2])

0 EMPNO int
1 ENAME text
2 JOB text
3 MGR int
4 HIREDATE date
5 SAL real
6 COMM int
7 DEPTNO int

In [4]:
 employes = [(7369, 'SMITH',  'CLERK', 7902, '2005-12-11', 800, 150 , 20),
 (7499, 'ALLEN',  'SALESMAN', 7698, '2006-02-23',1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698,'2006-02-26', 1250, 500, 30),
 (7566, 'JONES','MANAGER', 7839,'2006-04-02', 2975, 520, 20),            
 (7654, 'MARTIN','SALESMAN', 7698,'2006-09-28', 1400, 420, 30),
 (7698, 'BLAKE','MANAGER', 7839,'2006-05-1', 2850, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09',2450, 580,10),
 (7788, 'SCOTT', 'ANALYST', 7566,'2007-12-09',3000,640,20),
 (7839, 'KING','PRESIDENT','', '2006-11-17',5000,0,10),
 (7844, 'TURNER', 'SALESMAN',7698,'2006-09-13',1500,0,30),
 (7876, 'ADAMS', 'CLERK',7788, '2008-01-12',1100,50,20),
 (7900, 'JAMES', 'CLERK',7698, '2006-12-03',950,40,30),
 (7902, 'FORD', 'ANALYST',7566,'2006-12-03',3000,10,20),
 (7934, 'MILLER','CLERK',7782,'2007-01-23',1300,"",10)]

In [ ]:
type(employes[0])

tuple

In [5]:
cursor.executemany('INSERT INTO EMP VALUES (?,?,?,?,?,?,?,?)', employes)
engine.commit()

In [6]:
#### READ THE CONTENTS OF EMP TABLE 
cursor.execute('SELECT * FROM EMP').fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 800.0, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 2975.0, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3000.0, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1100.0, 50, 20),
 (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3000.0, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [7]:
cursor.execute('''CREATE TABLE IF NOT EXISTS DEPT
             (DEPTNO int not null, DNAME  text, LOC text)''')

In [8]:
depts = [(10,'ACCOUNTING','NEW YORK'),
         (20,'RESEARCH','DALLAS'),
         (30,'SALES','CHICAGO'),
         (40,'OPERATIONS','BOSTON')]

In [ ]:
type(depts)

list

In [9]:
cursor.executemany('INSERT INTO DEPT VALUES (?,?,?)', depts)

In [ ]:
cursor.execute('SELECT * FROM DEPT').fetchall()

[(10, 'ACCOUNTING', 'NEW YORK'),
 (20, 'RESEARCH', 'DALLAS'),
 (30, 'SALES', 'CHICAGO'),
 (40, 'OPERATIONS', 'BOSTON')]

In [ ]:
### SELECT - Filtrando por atributos (Colunas) ##### 

data = cursor.execute('select ename as NAME, job as JOB_A from emp').fetchall()
print(cursor.description[0][0],"     ",cursor.description[1][0])
#for x in cursor.description: 
#    print(x[0])
for row in data: 
  print(row)

NAME       JOB_A
('SMITH', 'CLERK')
('ALLEN', 'SALESMAN')
('WARD', 'SALESMAN')
('JONES', 'MANAGER')
('MARTIN', 'SALESMAN')
('BLAKE', 'MANAGER')
('CLARK', 'MANAGER')
('SCOTT', 'ANALYST')
('KING', 'PRESIDENT')
('TURNER', 'SALESMAN')
('ADAMS', 'CLERK')
('JAMES', 'CLERK')
('FORD', 'ANALYST')
('MILLER', 'CLERK')

In [ ]:
cursor.description

(('NAME', None, None, None, None, None, None),
 ('JOB_A', None, None, None, None, None, None))

In [ ]:
cursor.execute('PRAGMA table_info(emp)').fetchall()

[(0, 'EMPNO', 'int', 0, None, 0),
 (1, 'ENAME', 'text', 0, None, 0),
 (2, 'JOB', 'text', 0, None, 0),
 (3, 'MGR', 'int', 0, None, 0),
 (4, 'HIREDATE', 'date', 0, None, 0),
 (5, 'SAL', 'real', 0, None, 0),
 (6, 'COMM', 'int', 0, None, 0),
 (7, 'DEPTNO', 'int', 0, None, 0)]

In [ ]:
### Retrieving a Subset of Rows from a Table #### 
#### SELECT xxxx FROM TABLE Where clause ####
sql_select = 'SELECT ename FROM emp WHERE deptno < 30'
cursor.execute(sql_select).fetchall()

[('SMITH',),
 ('JONES',),
 ('CLARK',),
 ('SCOTT',),
 ('KING',),
 ('ADAMS',),
 ('FORD',),
 ('MILLER',)]

In [ ]:
### Ex 2 - Count ###3
sql_selectCount = 'SELECT count(deptno) FROM emp WHERE deptno=20'
cursor.execute(sql_selectCount).fetchall()

[(5,)]

In [ ]:
sql_selectAVG = 'SELECT avg(sal) FROM emp'
cursor.execute(sql_selectAVG).fetchall()

[(2083.9285714285716,)]

In [ ]:
sql_selectAVG = 'SELECT avg(sal) FROM emp WHERE job ="SALESMAN"'
cursor.execute(sql_selectAVG).fetchall()

[(1437.5,)]

In [ ]:
### emp.groupby('sal').mean() ####

In [ ]:
### Ex 3 - DISTINCT ###
sql_distinct = 'SELECT DISTINCT job FROM emp'
cursor.execute(sql_distinct).fetchall()

[('CLERK',), ('SALESMAN',), ('MANAGER',), ('ANALYST',), ('PRESIDENT',)]

### SYNTAX (UPDATE): 

### UPDATE table_name SET column_name=new_value [, ...] WHERE expression

In [ ]:
### Modificar salário ->. sal = 1.10*sal  para o departamento 20 ##### 
sql_update = 'UPDATE emp SET sal = 1.10*sal WHERE deptno=20'
cursor.execute(sql_update).fetchall()

[]

In [ ]:
cursor.execute('SELECT sal FROM emp WHERE deptno=20').fetchall()

[(880.0000000000001,),
 (3272.5000000000005,),
 (3300.0000000000005,),
 (1210.0,),
 (3300.0000000000005,)]

In [ ]:
### Using Conditional Logic in a SELECT Statement #### 
#### CASE WHEN condição (sal <=2000) THEN faz alguma ação ("UNDERPAID")
###  WHEN outra condição  xxx THEN uma outra ação ("OVERPAID")
### else executa última ação ("OK")
### end fecha a clausla do case

In [ ]:
### Using Conditional Logic in a SELECT Statement #### 
cursor.execute('SELECT ename,sal, CASE WHEN sal <= 2000 THEN "UNDERPAID"\
                WHEN sal >= 4000 THEN "OVERPAID"\
                ELSE "OK" END as status from emp').fetchall()

[('SMITH', 880.0000000000001, 'UNDERPAID'),
 ('ALLEN', 1600.0, 'UNDERPAID'),
 ('WARD', 1250.0, 'UNDERPAID'),
 ('JONES', 3272.5000000000005, 'OK'),
 ('MARTIN', 1400.0, 'UNDERPAID'),
 ('BLAKE', 2850.0, 'OK'),
 ('CLARK', 2450.0, 'OK'),
 ('SCOTT', 3300.0000000000005, 'OK'),
 ('KING', 5000.0, 'OVERPAID'),
 ('TURNER', 1500.0, 'UNDERPAID'),
 ('ADAMS', 1210.0, 'UNDERPAID'),
 ('JAMES', 950.0, 'UNDERPAID'),
 ('FORD', 3300.0000000000005, 'OK'),
 ('MILLER', 1300.0, 'UNDERPAID')]

In [ ]:
### Limiting the Number of Rows Returned -> equivalente ao head() #### 
sql_selectLIMIT = 'SELECT * FROM emp LIMIT 15'
cursor.execute(sql_selectLIMIT).fetchall()

[(7369, 'SMITH', 'CLERK', 7902, '2005-12-11', 880.0000000000001, 150, 20),
 (7499, 'ALLEN', 'SALESMAN', 7698, '2006-02-23', 1600.0, 300, 30),
 (7521, 'WARD', 'SALESMAN', 7698, '2006-02-26', 1250.0, 500, 30),
 (7566, 'JONES', 'MANAGER', 7839, '2006-04-02', 3272.5000000000005, 520, 20),
 (7654, 'MARTIN', 'SALESMAN', 7698, '2006-09-28', 1400.0, 420, 30),
 (7698, 'BLAKE', 'MANAGER', 7839, '2006-05-1', 2850.0, 600, 30),
 (7782, 'CLARK', 'MANAGER', 7839, '2006-06-09', 2450.0, 580, 10),
 (7788, 'SCOTT', 'ANALYST', 7566, '2007-12-09', 3300.0000000000005, 640, 20),
 (7839, 'KING', 'PRESIDENT', '', '2006-11-17', 5000.0, 0, 10),
 (7844, 'TURNER', 'SALESMAN', 7698, '2006-09-13', 1500.0, 0, 30),
 (7876, 'ADAMS', 'CLERK', 7788, '2008-01-12', 1210.0, 50, 20),
 (7900, 'JAMES', 'CLERK', 7698, '2006-12-03', 950.0, 40, 30),
 (7902, 'FORD', 'ANALYST', 7566, '2006-12-03', 3300.0000000000005, 10, 20),
 (7934, 'MILLER', 'CLERK', 7782, '2007-01-23', 1300.0, '', 10)]

In [ ]:
### Returning Valores aleatórios #####

In [10]:
sql_selectRandom = 'SELECT ename,job FROM emp ORDER BY random() LIMIT 5'
cursor.execute(sql_selectRandom).fetchall()

[('ADAMS', 'CLERK'),
 ('ALLEN', 'SALESMAN'),
 ('FORD', 'ANALYST'),
 ('CLARK', 'MANAGER'),
 ('JAMES', 'CLERK')]

In [13]:
## Searching for Patterns ####
## Ex1 - buscar valores dentro de um intervalo
sql_selectIn = 'SELECT ename,job FROM emp WHERE deptno IN (10,20)'
cursor.execute(sql_selectIn).fetchall()

[('SMITH', 'CLERK'),
 ('JONES', 'MANAGER'),
 ('CLARK', 'MANAGER'),
 ('SCOTT', 'ANALYST'),
 ('KING', 'PRESIDENT'),
 ('ADAMS', 'CLERK'),
 ('FORD', 'ANALYST'),
 ('MILLER', 'CLERK')]

In [27]:
## Searching for Patterns ####
## Ex2 - substring ##### 
sql_selectLIKE = 'SELECT ename,job FROM emp WHERE deptno IN (10,20) AND (job LIKE "AN%")'
cursor.execute(sql_selectLIKE).fetchall()

[('SCOTT', 'ANALYST'), ('FORD', 'ANALYST')]

In [29]:
#### Order by ### 
### Ascendent ###
#sql_selectORDERBY = 'SELECT ename,job,sal FROM emp WHERE deptno IN (10,20) ORDER BY sal ASC'
sql_selectORDERBY = 'SELECT ename,job,sal FROM emp WHERE deptno IN (10,20) ORDER BY sal DESC'
cursor.execute(sql_selectORDERBY).fetchall()

[('KING', 'PRESIDENT', 5000.0),
 ('SCOTT', 'ANALYST', 3000.0),
 ('FORD', 'ANALYST', 3000.0),
 ('JONES', 'MANAGER', 2975.0),
 ('CLARK', 'MANAGER', 2450.0),
 ('MILLER', 'CLERK', 1300.0),
 ('ADAMS', 'CLERK', 1100.0),
 ('SMITH', 'CLERK', 800.0)]

In [ ]:
### Achar datas a partir de 2000 ###

In [30]:
sql_selectHIREDATE = 'SELECT hiredate FROM emp WHERE hiredate LIKE "20%"'
cursor.execute(sql_selectHIREDATE).fetchall()

[('2005-12-11',),
 ('2006-02-23',),
 ('2006-02-26',),
 ('2006-04-02',),
 ('2006-09-28',),
 ('2006-05-1',),
 ('2006-06-09',),
 ('2007-12-09',),
 ('2006-11-17',),
 ('2006-09-13',),
 ('2008-01-12',),
 ('2006-12-03',),
 ('2006-12-03',),
 ('2007-01-23',)]

In [ ]:
#### ORDER BY SUBSTRING ##### 
### substr( string, start, length ) ##### 

### length(str) - retorna o tamanho da string = número de caracteres
### length(Nicolly) = 7 ; lly - substring(Nicolly,3,2) = co

In [32]:
select_order_by_substring = 'SELECT ename FROM emp ORDER BY substr(ename,2,3)'
#select_order_by_substring = 'SELECT ename FROM emp ORDER BY ename ASC'
cursor.execute(select_order_by_substring).fetchall()

[('JAMES',),
 ('WARD',),
 ('MARTIN',),
 ('SCOTT',),
 ('ADAMS',),
 ('MILLER',),
 ('KING',),
 ('BLAKE',),
 ('CLARK',),
 ('ALLEN',),
 ('SMITH',),
 ('JONES',),
 ('FORD',),
 ('TURNER',)]

In [37]:
### selecionar nomes terminando com RK ou TH
sql_substring = 'SELECT ename FROM emp WHERE substr(ename,length(ename)-1) IN("TH","RK")'
cursor.execute(sql_substring).fetchall()

[('SMITH',), ('CLARK',)]

In [ ]:
#### SELECT 
###. group by using native functions - COUNT and AVG
###  O que quero selecionar (atributos) 
### Por quem quero agrupar

In [38]:
sql_groupby = 'SELECT job, count(job) FROM emp GROUP BY job'
cursor.execute(sql_groupby).fetchall()

[('ANALYST', 2),
 ('CLERK', 4),
 ('MANAGER', 3),
 ('PRESIDENT', 1),
 ('SALESMAN', 4)]

### Quero obter o resultado abaixo, no entanto os atributos são de colunas diferentes

 
ENAME       LOC\
----------  ----------\
CLARK        NEW YORK\
KING         NEW YORK\
MILLER       NEW YORK

In [39]:
cursor.execute('PRAGMA table_info(dept)').fetchall()

[(0, 'DEPTNO', 'int', 1, None, 0),
 (1, 'DNAME', 'text', 0, None, 0),
 (2, 'LOC', 'text', 0, None, 0)]

In [40]:
### Selecionar todos os infos dos empregados e departamentos - mesmo departamentos_ID
sql_ImplictJoin = 'SELECT ename,loc FROM emp,dept WHERE emp.deptno = dept.deptno'
cursor.execute(sql_ImplictJoin).fetchall()

[('SMITH', 'DALLAS'),
 ('ALLEN', 'CHICAGO'),
 ('WARD', 'CHICAGO'),
 ('JONES', 'DALLAS'),
 ('MARTIN', 'CHICAGO'),
 ('BLAKE', 'CHICAGO'),
 ('CLARK', 'NEW YORK'),
 ('SCOTT', 'DALLAS'),
 ('KING', 'NEW YORK'),
 ('TURNER', 'CHICAGO'),
 ('ADAMS', 'DALLAS'),
 ('JAMES', 'CHICAGO'),
 ('FORD', 'DALLAS'),
 ('MILLER', 'NEW YORK')]

In [ ]:
### Selecionar somente os Nomes dos empregados e os nomes dos departamentos

In [ ]:
#### INNER JOIN ##### 
###  In SQLite, the INNER JOIN selects all rows from both participating tables 
##   to appear in the result if and only if both tables meet the conditions specified 
##  in the ON clause
## SELECT [result] from Tables [clausla de condicao ou comparacao]
## SELECT [results] from [ 1a Tabela] INNER JOIN [2a Tabela] ON [condicao de JOIN]

In [ ]:
### INSERT  PARA TESTAR LEFT OUTER####

In [ ]:
#### LEFT OUTER JOIN #### 
###  The Left Join or Left Outer Join operation takes two relations, A and B, and returns
###  the inner join of A and B along with the unmatched rows of A

In [ ]:
#### CROSS JOIN or CARTESIAN JOIN ####     
###  The Cartesian join is one of the fundamental relational operations. 
###  It is a kind of join that results in the combination of all rows from the 
##   first table with all rows in the second.